import math

with open('NEO_SYNTAGMA.txt','r') as f1:
    data = f1.read()

with open('NEO_SYNTAGMA_AB.txt','w') as f2:
    
    letters = {'α':0,'Α':0,'Ά':0,'ά':0,'β':0,'Β':0,'γ':0,'Γ':0,'δ':0,'Δ':0,'ε':0,'Ε':0,'Έ':0,'έ':0,
    'ζ':0,'Ζ':0,'η':0,'Η':0,'Ή':0,'ή':0,'θ':0,'Θ':0,'ι':0,'Ι':0,'Ί':0,'ί':0,'ϊ':0,'κ':0,'Κ':0,'λ':0,'Λ':0,
    'μ':0,'Μ':0,'ν':0,'Ν':0,'ξ':0,'Ξ':0,'ο':0,'Ο':0,'Ό':0,'ό':0,'π':0,'Π':0,'ρ':0,'Ρ':0,'σ':0,'Σ':0,'ς':0,
    'τ':0,'Τ':0,'υ':0,'Υ':0,'Ύ':0,'ύ':0,'ϋ':0,'φ':0,'Φ':0,'χ':0,'Χ':0,'ψ':0,'Ψ':0,'ω':0,'Ω':0,'Ώ':0,'ώ':0}

    for i in data:
        if i in letters.keys():
            f2.write(i)